In [1]:
import pandas as pd

175. Напишите программу, которая выводит имя, фамилию, город и штат каждого человека из таблицы Person . Если адрес personId отсутствует в таблице Address, выведите null вместо него.

In [2]:
import pandas as pd
data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})

In [3]:
person.head()

   personId firstName lastName
0         1      Wang    Allen
1         2     Alice      Bob

In [4]:
address.head()

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [20]:
result = pd.merge(person,address, on = 'personId', how='left')\
    [['firstName', 'lastName', 'city', 'state']]

181. Напишите решение, как найти сотрудников, которые зарабатывают больше, чем их руководители.

In [10]:
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})

In [11]:
employee.head()

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       <NA>
3   4    Max   90000       <NA>

In [26]:
pd.merge(employee,employee, left_on='managerId', right_on='id', how='left', suffixes=('_left', '_right'))\
    .query('salary_right<salary_left')\
    .rename(columns={'name_left':'Employee'})\
    [['Employee']]

  Employee
0      Joe

182. Напишите код для поиска всех повторяющихся электронных адресов. Обратите внимание, что поле email не может быть пустым.

In [16]:
data = [[1, 'a@b.com'], [2, 'c@d.com'], [3, 'a@b.com']]
person = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'Int64', 'email':'object'})
person

   id    email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com

In [7]:
person.groupby('email', as_index=False).agg({'id': 'count'})\
    .query('id>1')\
    [['email']]

     email
0  a@b.com

183. Клиенты, которые никогда ничего не заказывают  
Напишите программу для поиска всех клиентов, которые никогда ничего не заказывали.  
Вернуть таблицу результатов в любом порядке.  
Формат результата показан в следующем примере.

In [25]:
data = [
    {'id': 1, 'name': 'Joe'},
    {'id': 2, 'name': 'Henry'},
    {'id': 3, 'name': 'Sam'},
    {'id': 4, 'name': 'Max'}
]
customers = pd.DataFrame(data)
data_orders = [
    [1, 3],
    [2, 1]
]
orders = pd.DataFrame(data_orders, columns=['id','customerId'])
customers

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [26]:
orders

   id  customerId
0   1           3
1   2           1

In [30]:
pd.merge(customers, orders, left_on='id', right_on='customerId', how='left').query('customerId.isnull()')['id_x']

1    2
3    4
Name: id_x, dtype: int64

In [31]:
customers[~customers['id'].isin(orders['customerId'])]

   id   name
1   2  Henry
3   4    Max

196. Удаление дубликатов писем  
Напишите решение для удаления всех повторяющихся писем, оставив только одно уникальное письмо с наименьшим id.
Пользователи Pandas, обратите внимание, что Person нужно изменять на месте.
После запуска вашего скрипта отобразится таблица Person . Драйвер сначала скомпилирует и запустит ваш фрагмент кода, а затем отобразит таблицу Person . Окончательный порядок таблицы Personне имеет значения.

In [32]:
data = [[1, 'john@example.com'], [2, 'bob@example.com'], [3, 'john@example.com']]
person = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'int64', 'email':'object'})
person

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [36]:
person.groupby('email', as_index=False).agg({'id': 'min'})[['id', 'email']]

   id             email
0   2   bob@example.com
1   1  john@example.com

In [ ]:
person.sort_values(by='id').drop_duplicates(subset=['email'], keep='first')
# решение спорное и менее оптимизировано, чем первое

   id             email
0   1  john@example.com
1   2   bob@example.com

197. Повышение температуры  
Напишите программу, которая находит все даты id с более высокими температурами по сравнению с предыдущими датами (вчерашними). 
Верните таблицу результатов в любом порядке.

In [39]:
import pandas as pd
data = [[1, '2015-01-01', 10], [2, '2015-01-02', 25], [3, '2015-01-03', 20], [4, '2015-01-04', 30]]
weather = pd.DataFrame(data, columns=['id', 'recordDate', 'temperature']).astype({'id':'Int64', 'recordDate':'datetime64[ns]', 'temperature':'Int64'})
weather

   id recordDate  temperature
0   1 2015-01-01           10
1   2 2015-01-02           25
2   3 2015-01-03           20
3   4 2015-01-04           30

In [40]:
weather[(weather.temperature.diff() > 0) & (weather.recordDate.diff().dt.days == 1)][['id']]

   id
1   2
3   4

SELECT today.id   
FROM Weather yesterday  
CROSS JOIN Weather today  
WHERE today.recorddate - yesterday.recorddate = 1  
    AND today.temperature > yesterday.temperature   
;

511. Анализ игрового процесса I  
Напишите решение для поиска даты первого входа в систему для каждого игрока.

In [41]:
data = [
    {'player_id': 1, 'device_id': 2, 'event_date': '2016-03-01', 'games_played': 5},
    {'player_id': 1, 'device_id': 2, 'event_date': '2016-05-02', 'games_played': 6},
    {'player_id': 2, 'device_id': 3, 'event_date': '2017-06-25', 'games_played': 1},
    {'player_id': 3, 'device_id': 1, 'event_date': '2016-03-02', 'games_played': 0},
    {'player_id': 3, 'device_id': 4, 'event_date': '2018-07-03', 'games_played': 5}
]
activity = pd.DataFrame(data)
activity

   player_id  device_id  event_date  games_played
0          1          2  2016-03-01             5
1          1          2  2016-05-02             6
2          2          3  2017-06-25             1
3          3          1  2016-03-02             0
4          3          4  2018-07-03             5

In [43]:
activity.groupby('player_id').agg({'event_date': 'min'}).rename(columns={'event_date': 'first_login'})

          first_login
player_id
1          2016-03-01
2          2017-06-25
3          2016-03-02

586. Клиент, оформивший наибольшее количество заказов  
Напишите решение, чтобы найти customer_number для клиента, который сделал наибольшее количество заказов.  
Тестовые сценарии составлены таким образом, чтобы ровно один клиент разместил больше заказов, чем любой другой клиент.

In [44]:
data = [[1, 1], [2, 2], [3, 3], [4, 3]]
orders = pd.DataFrame(data, columns=['order_number', 'customer_number']).astype({'order_number':'Int64', 'customer_number':'Int64'})
orders

   order_number  customer_number
0             1                1
1             2                2
2             3                3
3             4                3

In [49]:
orders.groupby('customer_number', as_index=False).agg({'order_number': 'count'}).sort_values(by='order_number', ascending=False).head(1)['customer_number']

2    3
Name: customer_number, dtype: Int64

In [50]:
orders['customer_number'].value_counts().sort_values(ascending=False).index[0]

np.int64(3)

577. Бонус для сотрудников. Напишите решение, которое выведет имя и размер бонуса каждого сотрудника, получившего бонус меньше чем 1000

In [51]:
data = [[3, 'Brad', None, 4000], [1, 'John', 3, 1000], [2, 'Dan', 3, 2000], [4, 'Thomas', 3, 4000]]
employee = pd.DataFrame(data, columns=['empId', 'name', 'supervisor', 'salary']).astype({'empId':'Int64', 'name':'object', 'supervisor':'Int64', 'salary':'Int64'})
data = [[2, 500], [4, 2000]]
bonus = pd.DataFrame(data, columns=['empId', 'bonus']).astype({'empId':'Int64', 'bonus':'Int64'})
employee

   empId    name  supervisor  salary
0      3    Brad        <NA>    4000
1      1    John           3    1000
2      2     Dan           3    2000
3      4  Thomas           3    4000

In [52]:
bonus

   empId  bonus
0      2    500
1      4   2000

In [61]:
pd.merge(employee, bonus, on='empId', how='left').query('bonus.fillna(0)<1000')[['name', 'bonus']]

   name  bonus
0  Brad   <NA>
1  John   <NA>
2   Dan    500

584. Найдите представителя клиента, которые:  
по рекомендации любого клиента с id != 2.  
не по рекомендации ни одного клиента.

In [2]:
data = [[1, 'Will', None], [2, 'Jane', None], [3, 'Alex', 2], [4, 'Bill', None], [5, 'Zack', 1], [6, 'Mark', 2]]
customer = pd.DataFrame(data, columns=['id', 'name', 'referee_id']).astype({'id':'Int64', 'name':'object', 'referee_id':'Int64'})
customer

   id  name  referee_id
0   1  Will        <NA>
1   2  Jane        <NA>
2   3  Alex           2
3   4  Bill        <NA>
4   5  Zack           1
5   6  Mark           2

In [11]:
customer.query('referee_id != 2 or referee_id.isnull()')[['name']]

   name
0  Will
1  Jane
3  Bill
4  Zack

586. Клиент, оформивший наибольшее количество заказов  
Напишите решение, которое поможет найти customer_number для клиента, сделавшего наибольшее количество заказов.
Тестовые примеры генерируются таким образом, что ровно один клиент сделает больше заказов, чем любой другой клиент.

In [2]:
data = [[1, 1], [2, 2], [3, 3], [4, 3]]
orders = pd.DataFrame(data, columns=['order_number', 'customer_number']).astype({'order_number':'Int64', 'customer_number':'Int64'})
orders

   order_number  customer_number
0             1                1
1             2                2
2             3                3
3             4                3

In [6]:
orders.groupby('customer_number', as_index=False).agg({'order_number': 'count'}).sort_values(by='order_number', ascending=False).head(1)[['customer_number']]

   customer_number
2                3

595. Крупные страны. Напишите решение для поиска названия, численности населения и площади крупных стран. Страна большая, если:  
его площадь составляет не менее трёх миллионов (то есть 3000000 km2), или  
его население составляет не менее двадцати пяти миллионов (т. е. 25000000).

In [2]:
data = [['Afghanistan', 'Asia', 652230, 25500100, 20343000000], ['Albania', 'Europe', 28748, 2831741, 12960000000], ['Algeria', 'Africa', 2381741, 37100000, 188681000000], ['Andorra', 'Europe', 468, 78115, 3712000000], ['Angola', 'Africa', 1246700, 20609294, 100990000000]]
world = pd.DataFrame(data, columns=['name', 'continent', 'area', 'population', 'gdp']).astype({'name':'object', 'continent':'object', 'area':'Int64', 'population':'Int64', 'gdp':'Int64'})
world

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [4]:
world.query('area >= 3000000 or population >= 25000000')[['name', 'population', 'area']]

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741

596. Классы, в которых учится не менее 5 человек  
Напишите программу для поиска всех классов, в которых не менее пяти учеников.

In [5]:
data = [['A', 'Math'], ['B', 'English'], ['C', 'Math'], ['D', 'Biology'], ['E', 'Math'], ['F', 'Computer'], ['G', 'Math'], ['H', 'Math'], ['I', 'Math']]
courses = pd.DataFrame(data, columns=['student', 'class']).astype({'student':'object', 'class':'object'})
courses

  student     class
0       A      Math
1       B   English
2       C      Math
3       D   Biology
4       E      Math
5       F  Computer
6       G      Math
7       H      Math
8       I      Math

In [8]:
courses.groupby('class', as_index=False).agg({'student': 'count'}).query('student >= 5')[['class']]

  class
3  Math

607. Продавец. Напишите программу, которая находит имена всех продавцов, у которых не было заказов, связанных с компанией «RED».

In [22]:
data = [[1, 'John', 100000, 6, '4/1/2006'], [2, 'Amy', 12000, 5, '5/1/2010'], [3, 'Mark', 65000, 12, '12/25/2008'], [4, 'Pam', 25000, 25, '1/1/2005'], [5, 'Alex', 5000, 10, '2/3/2007']]
sales_person = pd.DataFrame(data, columns=['sales_id', 'name', 'salary', 'commission_rate', 'hire_date']).astype({'sales_id':'Int64', 'name':'object', 'salary':'Int64', 'commission_rate':'Int64', 'hire_date':'datetime64[ns]'})
data = [[1, 'RED', 'Boston'], [2, 'ORANGE', 'New York'], [3, 'YELLOW', 'Boston'], [4, 'GREEN', 'Austin']]
company = pd.DataFrame(data, columns=['com_id', 'name', 'city']).astype({'com_id':'Int64', 'name':'object', 'city':'object'})
data = [[1, '1/1/2014', 3, 4, 10000], [2, '2/1/2014', 4, 5, 5000], [3, '3/1/2014', 1, 1, 50000], [4, '4/1/2014', 1, 4, 25000]]
orders = pd.DataFrame(data, columns=['order_id', 'order_date', 'com_id', 'sales_id', 'amount']).astype({'order_id':'Int64', 'order_date':'datetime64[ns]', 'com_id':'Int64', 'sales_id':'Int64', 'amount':'Int64'})
sales_person

   sales_id  name  salary  commission_rate  hire_date
0         1  John  100000                6 2006-04-01
1         2   Amy   12000                5 2010-05-01
2         3  Mark   65000               12 2008-12-25
3         4   Pam   25000               25 2005-01-01
4         5  Alex    5000               10 2007-02-03

In [10]:
company

   com_id    name      city
0       1     RED    Boston
1       2  ORANGE  New York
2       3  YELLOW    Boston
3       4   GREEN    Austin

In [11]:
orders

   order_id order_date  com_id  sales_id  amount
0         1 2014-01-01       3         4   10000
1         2 2014-02-01       4         5    5000
2         3 2014-03-01       1         1   50000
3         4 2014-04-01       1         4   25000

In [26]:
sales_person[
        ~sales_person['sales_id'].isin(
            pd.merge(
                left=orders,
                right=company[company['name'] == 'RED'],
                on='com_id',
                how='inner',
            )['sales_id'].unique()
        )
    ][['name']]

   name
1   Amy
2  Mark
4  Alex

610. Решение треугольника. Для каждых трёх отрезков проверьте, могут ли они образовать треугольник.

In [27]:
data = [[13, 15, 30], [10, 20, 15]]
triangle = pd.DataFrame(data, columns=['x', 'y', 'z']).astype({'x':'Int64', 'y':'Int64', 'z':'Int64'})
triangle

    x   y   z
0  13  15  30
1  10  20  15

In [32]:
triangle['triangle'] = triangle.apply(
    lambda t: 'Yes' if ((t.x + t.y > t.z) & (t.y + t.z > t.x) & (t.x + t.z > t.y)) else 'No', axis=1)
triangle

    x   y   z triangle
0  13  15  30       No
1  10  20  15      Yes

619. Самое большое однозначное число. Одиночное число - это число, которое только один раз появлялось в таблице myNumbers.
Найдите наибольшее одиночное число. Если одиночного числа нет, укажите значение null

In [5]:
import pandas as pd
data = [[8], [8], [3], [3], [1], [4], [5], [6]]
my_numbers = pd.DataFrame(data, columns=['num']).astype({'num':'Int64'})
my_numbers

   num
0    8
1    8
2    3
3    3
4    1
5    4
6    5
7    6

In [17]:
my_numbers.groupby('num').size().reset_index(name='count').query('count==1').sort_values(by='num', ascending=False).head(1)[['num']]

   num
4    6

620. Нескучные фильмы. Напишите решение для поиска фильмов с нечётным идентификатором и описанием, которое не является "boring".

In [14]:
data = [[1, 'War', 'great 3D', 8.9], [2, 'Science', 'fiction', 8.5], [3, 'irish', 'boring', 6.2], [4, 'Ice song', 'Fantacy', 8.6], [5, 'House card', 'Interesting', 9.1]]
cinema = pd.DataFrame(data, columns=['id', 'movie', 'description', 'rating']).astype({'id':'Int64', 'movie':'object', 'description':'object', 'rating':'Float64'})
cinema

   id       movie  description  rating
0   1         War     great 3D     8.9
1   2     Science      fiction     8.5
2   3       irish       boring     6.2
3   4    Ice song      Fantacy     8.6
4   5  House card  Interesting     9.1

In [17]:
cinema.query('id%2>0 and description !="boring"').sort_values(by='rating', ascending=False)

   id       movie  description  rating
4   5  House card  Interesting     9.1
0   1         War     great 3D     8.9

627. Обмен зарплатой  
Напишите решение для замены всех значений 'f' и 'm' (т. е. замены всех значений 'f' на 'm' и наоборот) с помощью одного оператора обновления без использования промежуточных временных таблиц.  
Обратите внимание, что для решения этой задачи вам нужно написать один оператор обновления, не нужно писать оператор выбора.

In [2]:
data = [[1, 'A', 'm', 2500], [2, 'B', 'f', 1500], [3, 'C', 'm', 5500], [4, 'D', 'f', 500]]
salary = pd.DataFrame(data, columns=['id', 'name', 'sex', 'salary']).astype({'id':'Int64', 'name':'object', 'sex':'object', 'salary':'Int64'})
salary

   id name sex  salary
0   1    A   m    2500
1   2    B   f    1500
2   3    C   m    5500
3   4    D   f     500

In [8]:
salary['sex'] = salary['sex'].apply(lambda x: 'm' if x == 'f' else 'f')

1050. Актеры и режиссеры, Которые Сотрудничали Не менее трех раз  
Напишите решение, чтобы найти все пары (actor_id, director_id) в которых актёр сотрудничал с режиссёром как минимум три раза.

In [10]:
data = [[1, 1, 0], [1, 1, 1], [1, 1, 2], [1, 2, 3], [1, 2, 4], [2, 1, 5], [2, 1, 6]]
actor_director = pd.DataFrame(data, columns=['actor_id', 'director_id', 'timestamp']).astype({'actor_id':'int64', 'director_id':'int64', 'timestamp':'int64'})
actor_director

   actor_id  director_id  timestamp
0         1            1          0
1         1            1          1
2         1            1          2
3         1            2          3
4         1            2          4
5         2            1          5
6         2            1          6

In [15]:
actor_director.groupby(['actor_id', 'director_id'], as_index=False).agg({'timestamp': 'count'}).query('timestamp >=3')[['actor_id', 'director_id']]

   actor_id  director_id
0         1            1

1068. Анализ продаж продукции I. Напишите решение, которое будет выводить product_name, year, и price для каждого sale_id в таблице Sales.

In [16]:
data = [[1, 100, 2008, 10, 5000], [2, 100, 2009, 12, 5000], [7, 200, 2011, 15, 9000]]
sales = pd.DataFrame(data, columns=['sale_id', 'product_id', 'year', 'quantity', 'price']).astype({'sale_id':'Int64', 'product_id':'Int64', 'year':'Int64', 'quantity':'Int64', 'price':'Int64'})
data = [[100, 'Nokia'], [200, 'Apple'], [300, 'Samsung']]
product = pd.DataFrame(data, columns=['product_id', 'product_name']).astype({'product_id':'Int64', 'product_name':'object'})
sales

   sale_id  product_id  year  quantity  price
0        1         100  2008        10   5000
1        2         100  2009        12   5000
2        7         200  2011        15   9000

In [17]:
product

   product_id product_name
0         100        Nokia
1         200        Apple
2         300      Samsung

In [19]:
sales.merge(product, on='product_id')[['product_name', 'year', 'price']]

  product_name  year  price
0        Nokia  2008   5000
1        Nokia  2009   5000
2        Apple  2011   9000

1075. Сотрудники проекта I. Напишите SQL-запрос, который выведет средний стаж работы всех сотрудников в каждом проекте с округлением до двух знаков.

In [2]:
data = [[1, 1], [1, 2], [1, 3], [2, 1], [2, 4]]
project = pd.DataFrame(data, columns=['project_id', 'employee_id']).astype({'project_id':'Int64', 'employee_id':'Int64'})
data = [[1, 'Khaled', 3], [2, 'Ali', 2], [3, 'John', 1], [4, 'Doe', 2]]
employee = pd.DataFrame(data, columns=['employee_id', 'name', 'experience_years']).astype({'employee_id':'Int64', 'name':'object', 'experience_years':'Int64'})
project

   project_id  employee_id
0           1            1
1           1            2
2           1            3
3           2            1
4           2            4

In [3]:
employee

   employee_id    name  experience_years
0            1  Khaled                 3
1            2     Ali                 2
2            3    John                 1
3            4     Doe                 2

In [8]:
project.merge(employee, how='left', on='employee_id').groupby('project_id', as_index=False).agg({'experience_years':'mean'}).rename(columns={'experience_years':'average_years'}).round(2)

   project_id  average_years
0           1            2.0
1           2            2.5

1084. Анализ продаж III. Напишите решение для вывода списка товаров, которые были проданы только в первом квартале 2019. То есть в период с 2019-01-01 по 2019-03-31 включительно.

In [9]:
import pandas as pd
data = [[1, 'S8', 1000], [2, 'G4', 800], [3, 'iPhone', 1400]]
product = pd.DataFrame(data, columns=['product_id', 'product_name', 'unit_price']).astype({'product_id':'Int64', 'product_name':'object', 'unit_price':'Int64'})
data = [[1, 1, 1, '2019-01-21', 2, 2000], [1, 2, 2, '2019-02-17', 1, 800], [2, 2, 3, '2019-06-02', 1, 800], [3, 3, 4, '2019-05-13', 2, 2800]]
sales = pd.DataFrame(data, columns=['seller_id', 'product_id', 'buyer_id', 'sale_date', 'quantity', 'price']).astype({'seller_id':'Int64', 'product_id':'Int64', 'buyer_id':'Int64', 'sale_date':'datetime64[ns]', 'quantity':'Int64', 'price':'Int64'})
product

   product_id product_name  unit_price
0           1           S8        1000
1           2           G4         800
2           3       iPhone        1400

In [10]:
sales

   seller_id  product_id  buyer_id  sale_date  quantity  price
0          1           1         1 2019-01-21         2   2000
1          1           2         2 2019-02-17         1    800
2          2           2         3 2019-06-02         1    800
3          3           3         4 2019-05-13         2   2800

In [21]:
product[product.product_id.isin(
    sales.loc[sales.sale_date.between('2019-01-01','2019-03-31'),'product_id']
    .unique()
) & ~product.product_id.isin(
    sales.loc[~sales.sale_date.between('2019-01-01','2019-03-31'),'product_id']
    .unique()
)][['product_id', 'product_name']]

   product_id product_name
0           1           S8

In [23]:
df_period = sales[(sales['sale_date'] >= '2019-01-01') & (sales['sale_date'] <= '2019-03-31')]
df_res = sales[~((sales['sale_date'] >= '2019-01-01') & (sales['sale_date'] <= '2019-03-31'))]
pd.merge(\
    df_period[~df_period['product_id']\
    .isin(df_res['product_id'])],\
    product, on='product_id'
)[['product_id', 'product_name']].drop_duplicates()

   product_id product_name
0           1           S8